.. _nip_userguide:

NIP Strings
============

Introduction
------------

The function :func:`clean_pl_nip() <dataprep.clean.clean_pl_nip.clean_pl_nip>` cleans a column containing Polish VAT number (NIP) strings, and standardizes them in a given format. The function :func:`validate_pl_nip() <dataprep.clean.clean_pl_nip.validate_pl_nip>` validates either a single NIP strings, a column of NIP strings or a DataFrame of NIP strings, returning `True` if the value is valid, and `False` otherwise.

NIP strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "8567346215"
* `standard`: NIP strings with proper whitespace in the proper places, like "856-734-62-15"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_pl_nip()` and `validate_pl_nip()`.

### An example dataset containing NIP strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nip": [
            "PL 8567346215",
            "PL 8567346216",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              nip                                           address
0   PL 8567346215                                     123 Pine Ave.
1   PL 8567346216                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_pl_nip`

By default, `clean_pl_nip` will clean nip strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_pl_nip
clean_pl_nip(df, column = "nip")

,nip,address,nip_clean
0,PL 8567346215,123 Pine Ave.,856-734-62-15
1,PL 8567346216,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_pl_nip(df, column = "nip", output_format="standard")

,nip,address,nip_clean
0,PL 8567346215,123 Pine Ave.,856-734-62-15
1,PL 8567346216,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_pl_nip(df, column = "nip", output_format="compact")

,nip,address,nip_clean
0,PL 8567346215,123 Pine Ave.,8567346215
1,PL 8567346216,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NIP strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_pl_nip(df, column="nip", inplace=True)

       nip_clean                                           address
0  856-734-62-15                                     123 Pine Ave.
1            NaN                                           main st
2            NaN                      1234 west main heights 57033
3            NaN                    apt 1 789 s maple rd manhattan
4            NaN                robie house, 789 north main street
5            NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_pl_nip(df, "nip", errors="coerce")

,nip,address,nip_clean
0,PL 8567346215,123 Pine Ave.,856-734-62-15
1,PL 8567346216,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_pl_nip(df, "nip", errors="ignore")

,nip,address,nip_clean
0,PL 8567346215,123 Pine Ave.,856-734-62-15
1,PL 8567346216,main st,PL 8567346216
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_pl_nip()`

`validate_pl_nip()` returns `True` when the input is a valid NIP. Otherwise it returns `False`.

The input of `validate_pl_nip()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_pl_nip()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_pl_nip()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_pl_nip
print(validate_pl_nip("PL 8567346215"))
print(validate_pl_nip("PL 8567346216"))
print(validate_pl_nip("51824753556"))
print(validate_pl_nip("51 824 753 556"))
print(validate_pl_nip("hello"))
print(validate_pl_nip(np.nan))
print(validate_pl_nip("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_pl_nip(df["nip"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nip, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_pl_nip(df, column="nip")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nip, dtype: bool

### Only DataFrame

In [11]:
validate_pl_nip(df)

     nip  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False